usr/share/doc/escenic/ece-install-guide.org
Welcome to the /usr/sbin/ece-install Guide

* Supported Operating Systems
For the best experience, run this script on Debian Squeeze (or newer),
the latest Ubuntu LTS or most other Debian based operating systems,
but it should work without any problems on any Unix like system that
has a recent version of BASH.

*** Debian based operating systems
If running on a Debian based operating system, ece-install will take
care of installing all required third party software, such as database
& caching server.

*** Other GNU/Linux and Unix systems 
If you're installing on another Linux or Unix system, you must first
make sure that these 3rd party components are installed. ece-install
will tell you which ones it cannot find and tell you to install these,
so you can simply run it to find out which ones you need.

You may also look inside the ece-install script for all calls to the
'assert\_pre\_prequesite' method and you'll get a list of the binaries
ece-install assumes are present.

* A Note on Running ece-install On Non-GNU/Linux Systems
Please note, it's assumed that the OS uses GNU's tools, i.e. find, cp
& tar. If you're running a system which has a different set of core
tools, such as any of the BSDs (including Mac OS X) or Solaris, make
sure that GNU's tools take precedence in the command PATH offered to
ece-install.

* Downloading the ece-install Script
The ece-install script can be downloaded from:
https://raw.github.com/skybert/ece-scripts/master/usr/sbin/ece-install
or be downloaded together with the other ece-scripts using git:
#+BEGIN_SRC sh
$ git clone git@github.com:skybert/ece-scripts.git
#+END_SRC

* Running the ece-install Script
You must run the script as the root user.  If you start the script as
a regular user, it will complain:
#+BEGIN_SRC sh
[ece-install] You must be root when running ece-install
#+END_SRC
To become root on Ubuntu based systems and Mac OS X, do:
#+BEGIN_SRC sh
   $ sudo su
#+END_SRC
On all other Unix like system, do:
#+BEGIN_SRC sh
   $ su
#+END_SRC

You will need access to http://technet.escenic.com and put these
credentials in the root user's $HOME/.ece-install.conf, normally this
means /root/.ece-install.conf, the script will also tell you this if
you forget to provide such a configuration file:
#+BEGIN_SRC sh
[ece-install] /root/.ece-install.conf doesn't exist, I cannot live without it :-(
#+END_SRC

As for the technet credentials, the script will also tell you if it
cannot find what it's looking for:
#+BEGIN_SRC sh
[ece-install] Be sure to set technet_user and technet_password
[ece-install] in /root/.ece-install.conf
#+END_SRC

The minimum .ece-install.conf file is thus:
#+BEGIN_SRC sh
technet_user=<user>
technet_password=<password>
#+END_SRC

If you're installing WF as well, you'll need additional credentials
for this, see the Widget Framwork section below, and if you want to
runn a fully automatic install without any user interaction, you'll
need to specify some FAI specific parameters, see the FAI section
below. 

With the configuration file in place, you're now ready to run it:
#+BEGIN_SRC sh
# bash ece-install [-v|--verbose]
#+END_SRC

ece-install will try to "fail fast", exiting as soon as it detects an
error during its execution:
#+BEGIN_SRC sh
[ece-install-1] The command [cd /does/not/exist] FAILED, exiting :-(
[ece-install-1] See /var/log/ece-install.log for further details.
#+END_SRC

As a last resort, if something goes astray with the script, and the
log file cannot give you enough clues, the ultimate way of debugging
this is to run the BASH interpreter with the -x flag:
#+BEGIN_SRC sh
# bash -x ece-install
#+END_SRC

Here you can see everything that BASH does when running the script,
how the wildcard variables expand and so on. Normally, having a tail
on /var/log/ece-install.log should be sufficient, though.

