usr/share/doc/escenic/ece-install-guide.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Welcome to the /usr/sbin/ece-install Guide</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2011-09-12 17:32:07 CST"/>
<meta name="author" content="Torstein Krause Johansen"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>


</head>
<body>
<div id="content">

<svg
        id="vizrt-logo"
        version="1.1"
        width="138"
        height="84"
        > 
  <g
          id="g12"
          transform="matrix(1.25,0,0,-1.25,-451.34003,425.24315)"> 
    <g
            id="g14"
            transform="matrix(0.0246257,0,0,0.02458666,313.76213,231.21317)"> 
      <path
              d="m 3060.56,3437.2 -209.9,-593.4 -207.05,593.4 -215.82,0 326.08,-866.38 184.92,0 332.24,866.38 -210.47,0"
              style="fill:#f57615;fill-opacity:1;fill-rule:evenodd;stroke:none"
              id="path16"/> 
      <path
              d="m 3473.3,2569.82 193.547,0 0,866.531 -193.547,0 0,-866.531 z"
              style="fill:#f57615;fill-opacity:1;fill-rule:evenodd;stroke:none"
              id="path18"/> 
      <path
              d="m 3916.16,3436.36 -0.14,-177.24 364.23,0 -372.91,-554.74 0,-133.56 616.08,0 0,175.25 -374.66,0 366.68,550.78 0,139.51 -599.28,0"
              style="fill:#f57615;fill-opacity:1;fill-rule:evenodd;stroke:none"
              id="path20"/> 
      <path
              d="m 4961.8,3436.66 c -56.15,0 -99.9,-9.02 -144.01,-53.04 -42.13,-42.13 -63.55,-93.63 -63.55,-153.7 l 0,-658.85 193.26,0 0,629.18 c 0,16.39 5.76,30.04 17.53,41.82 9.79,9.87 32.16,17.44 52.18,17.44 l 161.49,0 0,177.15 -216.9,0"
              style="fill:#f57615;fill-opacity:1;fill-rule:evenodd;stroke:none"
              id="path22"/> 
      <path
              d="m 5367.91,3699.54 0,-915.91 c 0,-58.68 20.75,-109.43 62.13,-150.8 43.31,-43.47 85.57,-62.01 141.03,-62.01 l 212.69,0 0,174.7 -158.78,0 c -15.96,0 -28.96,5.5 -40.72,16.87 -11.19,11.53 -16.76,24.5 -16.76,40.65 l 0,456.42 216.26,0 0,176.39 -216.26,0 0,263.69 -199.59,0"
              style="fill:#f57615;fill-opacity:1;fill-rule:evenodd;stroke:none"
              id="path24"/> 
      <path
              d="m 1921.16,3066.86 c -0.39,-514.15 173.24,-988.49 465.56,-1367.51 l 69.26,204.63 c -205.49,300.61 -333.44,658.06 -355.3,1043.68 l -179.52,119.2"
              style="fill:#f57615;fill-opacity:1;fill-rule:evenodd;stroke:none"
              id="path26"/> 
      <path
              d="m 6404.28,3065.28 c 0.49,513.97 -173.17,988.55 -465.37,1367.26 l -69.46,-204.34 c 205.52,-300.7 333.61,-658.34 355.24,-1043.68 l 179.59,-119.24"
              style="fill:#f57615;fill-opacity:1;fill-rule:evenodd;stroke:none"
              id="path28"/> 
 
    </g> 
  </g> 
</svg>
<h1>Welcome to the /usr/sbin/ece-install Guide</h1>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Supported Operating Systems </a>
<ul>
<li>
<ul>
<li><a href="#sec-1-1">1.1 Debian based operating systems </a></li>
<li><a href="#sec-1-2">1.2 Other GNU/Linux and Unix systems </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-2">2 A Note on Running Ece-Install On Non-GNU/Linux Systems </a></li>
<li><a href="#sec-3">3 Downloading the ece-install Script </a></li>
<li><a href="#sec-4">4 Running the ece-install Script </a></li>
<li><a href="#sec-5">5 Available Server Profiles </a>
<ul>
<li><a href="#sec-5-1">5.1 Common for Editorial, Presentation and Search Instances </a>
<ul>
<li><a href="#sec-5-1-1">5.1.1 Sun Java 6 </a></li>
<li><a href="#sec-5-1-2">5.1.2 Apache Tomcat application server </a></li>
<li><a href="#sec-5-1-3">5.1.3 Basic Escenic Nursery configuration </a></li>
<li><a href="#sec-5-1-4">5.1.4 APR, native library for optimal Tomcat I/O performance </a></li>
<li><a href="#sec-5-1-5">5.1.5 Escenic Assembly environment </a></li>
<li><a href="#sec-5-1-6">5.1.6 Database driver </a></li>
<li><a href="#sec-5-1-7">5.1.7 Compression of content </a></li>
</ul>
</li>
<li><a href="#sec-5-2">5.2 1 - Full Stack on One Host </a></li>
<li><a href="#sec-5-3">5.3 2 - Editorial Server (Publication Server) </a></li>
<li><a href="#sec-5-4">5.4 3 - Presentation Server </a></li>
<li><a href="#sec-5-5">5.5 4 - Database Server </a></li>
<li><a href="#sec-5-6">5.6 5 - Cache Server </a></li>
<li><a href="#sec-5-7">5.7 8 - Install Widget Framework </a></li>
<li><a href="#sec-5-8">5.8 9 - Create Publication </a></li>
</ul>
</li>
<li><a href="#sec-6">6 Full Automatic Install (FAI) </a></li>
<li><a href="#sec-7">7 Running More Than One Installation Process </a></li>
<li><a href="#sec-8">8 Re-running ece-install (and How To Speed It Up) </a></li>
<li><a href="#sec-9">9 Overview of File Paths Used by the ece-install script </a></li>
<li><a href="#sec-10">10 Assumptions </a>
<ul>
<li><a href="#sec-10-1">10.1 /etc/esecenic is shared </a></li>
</ul>
</li>
<li><a href="#sec-11">11 Uninstalling Everything That the ece-install Set Up </a></li>
<li><a href="#sec-12">12 Example Output FAI </a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Supported Operating Systems </h2>
<div class="outline-text-2" id="text-1">

<p>For the best experience, run this script on Debian Squeeze (or newer),
the latest Ubuntu LTS or most other Debian based operating systems,
but it should work without any problems on any Unix like system that
has a recent version of BASH.
</p>

</div>

<div id="outline-container-1-1" class="outline-4">
<h4 id="sec-1-1"><span class="section-number-4">1.1</span> Debian based operating systems </h4>
<div class="outline-text-4" id="text-1-1">

<p>If running on a Debian based operating system, ece-install will take
care of installing all required third party software, such as database
&amp; caching server.
</p>
</div>

</div>

<div id="outline-container-1-2" class="outline-4">
<h4 id="sec-1-2"><span class="section-number-4">1.2</span> Other GNU/Linux and Unix systems </h4>
<div class="outline-text-4" id="text-1-2">

<p>If you're installing on another Linux or Unix system, you must first
make sure that these 3rd party components are installed. ece-install
will tell you which ones it cannot find and tell you to install these,
so you can simply run it to find out which ones you need.
</p>
<p>
You may also look inside the ece-install script for all calls to the
'assert_pre_prequesite' method and you'll get a list of the binaries
ece-install assumes are present.
</p>
</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> A Note on Running Ece-Install On Non-GNU/Linux Systems </h2>
<div class="outline-text-2" id="text-2">

<p>Please note, it's assumed that the OS uses GNU's tools, i.e. find, cp
&amp; tar. If you're running a system which has a different set of core
tools, such as any of the BSDs (including Mac OS X) or Solaris, make
sure that GNU's tools take precedence in the command PATH offered to
ece-install.
</p>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Downloading the ece-install Script </h2>
<div class="outline-text-2" id="text-3">

<p>The ece-install script can be downloaded from:
<a href="https://raw.github.com/skybert/ece-scripts/master/usr/sbin/ece-install">https://raw.github.com/skybert/ece-scripts/master/usr/sbin/ece-install</a>
or be downloaded together with the other ece-scripts using git:
</p>


<pre class="example">$ git clone git@github.com:skybert/ece-scripts.git

</pre>




</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Running the ece-install Script </h2>
<div class="outline-text-2" id="text-4">

<p>You must run the script as the root user.  If you start the script as
a regular user, it will complain:
</p>


<pre class="example">[ece-install] You must be root when running ece-install

</pre>



<p>
To become root on Ubuntu based systems and Mac OS X, do:
</p>


<pre class="example">$ sudo su

</pre>



<p>
On all other Unix like system, do:
</p>


<pre class="example">$ su

</pre>




<p>
You will need access to <a href="http://technet.escenic.com">http://technet.escenic.com</a> and put these
credentials in the root user's $HOME/.ece-install.conf, normally this
means <i>root</i>.ece-install.conf, the script will also tell you this if
you forget to provide such a configuration file:
</p>


<pre class="example">[ece-install] /root/.ece-install.conf doesn't exist, I cannot live without it :-(

</pre>




<p>
As for the technet credentials, the script will also tell you if it
cannot find what it's looking for:
</p>


<pre class="example">[ece-install] Be sure to set technet_user and technet_password
[ece-install] in /root/.ece-install.conf

</pre>




<p>
The minimum .ece-install.conf file is thus:
</p>


<pre class="example">technet_user=&lt;user&gt;
technet_password=&lt;password&gt;

</pre>




<p>
If you're installing WF as well, you'll need additional credentials
for this, see the Widget Framwork section below, and if you want to
runn a fully automatic install without any user interaction, you'll
need to specify some FAI specific parameters, see the FAI section
below. 
</p>
<p>
With the configuration file in place, you're now ready to run it:
</p>


<pre class="example"># bash ece-install [-v|--verbose]

</pre>




<p>
ece-install will try to "fail fast", exiting as soon as it detects an
error during its execution:
</p>


<pre class="example">[ece-install-1] The command [cd /does/not/exist] FAILED, exiting :-(
[ece-install-1] See /var/log/ece-install.log for further details.

</pre>




<p>
As a last resort, if something goes astray with the script, and the
log file cannot give you enough clues, the ultimate way of debugging
this is to run the BASH interpreter with the -x flag:
</p>


<pre class="example"># bash -x ece-install

</pre>




<p>
Here you can see everything that BASH does when running the script,
how the wildcard variables expand and so on. Normally, having a tail
on /var/log/ece-install.log should be sufficient, though.
</p>
</div>

</div>
