usr/share/doc/escenic/ece-install-guide.org
* Available Server Profiles
When starting the script, it will ask you which server profile you
want to install:
#+BEGIN_SRC sh
Hi, which server profile do you wish to install?

Select 1-9 and press ENTER

  1 - All in one, the full stack on one host. 
      Suitable for development and test environments.
      It will install caching server, ECE, assembly host, database &
      Widget Framework as well as set up a new publication.
  2 - Editorial (publication) server.
      This will install ECE and an assembly host.
  3 - Presentation server (ECE, memcached).
  4 - Database server.
  5 - Cache server (cache & web server).
  6 - RMI hub.
  7 - Standalone search instance (solr + indexer-webapp).
  8 - Install the Widget Framework.
      (You need user/pass for repo.escenic.com for this).
  9 - Create a new publication.
      This profile will create new publication based on WF
      (if available) or ECE/clean-demo.
#+END_SRC
** Common for All Server Profiles
The script will install a Munin node on the host. It will also
install the Escenic specific Munin plugins on hosts where there are
any Escenic server components.

TBD: there is currently an issue with the Escenic plugins not working
properly with the new ece/ece-install scripts. We're working on this.

** Common for Editorial, Presentation and Search Instances
*** Sun Java 6
*** Apache Tomcat application server
- Compression of textual content (previously, this was typically set
  up with Apache and its mod\_deflate module).
- pooling set up tweaked for high read/write performance.
- proper logging configuration directing solr messages to its own log.
- routing information in the cookies
- application server access log
*** Basic Escenic Nursery configuration
The basic Nursery configuration is taken care of for you, including RMI,
  database, search and application server/URIs. 
*** APR, native library for optimal Tomcat I/O performance
*** Escenic Assembly environment
The reason why ece-install sets this up on each host, is to make the
installation process as smooth as possible. The assembly environment
may be removed after the installation if you want to.

*** Database driver

*** Compression of content 
This was was previously accomplished by having a web server in fron t
of the application server (or cache server if you used ESI). A typical
system architecture would contain Apache with mod\_deflate. However,
this is no longer necessary as Varnish can handles ESI parsing of
compressed content (and many other things that we before needed Apache
for). Thus, we'll let the application server do the compression for us
now.

** 1 - Full Stack on One Host
This profile is suitable for developers and admins wanting to set up a
test environment. It will install the full stack including caching
server, application server, ECE, assembly host, database, Widget
Framework, as well as creating a publication for you.

For further details on each of the different server components, see
the different profile descriptions bellow.


** 2 - Editorial Server (Publication Server)


** 3 - Presentation Server
This will set up a typical presentation server:
- Memcached, distributed memory cache
- Escenic Assembly environment (which may be removed after the
  installation). 
- Deployment setup to only deploy escenic-admin and the
  publication(s).

** 4 - Database Server
If ece-install is run on a support version of Debian or Ubuntu, this
will install the excellent Percona distribution of MySQL with their
set of high performance patches.

If not, MySQL or Percona must be installed in advance.

Given that the mysqld is install, this profile will download all the
Escenic components and install the ECE database schema based from the
SQL files contained inside the distribution bundles. To accomplish
this, the script will make a call to drop-and-create-ecedb in the same
directory as the ece-intall script itself.

The script will fail by itself if the DB already exists:
#+BEGIN_SRC sh
[ece-install] Setting up the ECE database schema ...
ERROR 1007 (HY000) at line 1: Can't create database 'ece5db'; database exists
ERROR 1050 (42S01) at line 2: Table 'DBChangeLog' already exists
[ece-install] running tables FAILED, exiting :-(
#+END_SRC

** 5 - Cache Server
If ece-install is run on a support version of Debian or Ubuntu, it
will install the latest Varnish 3.0 caching server from the Varnish
APT repository.

If ece-install is run on a different platform, the admin must install
Varnish 3.x prior to running ece-install.

The script will configure Varnish for a typical Escenic site:
- it will set up the cache server on port 80
- will set up an access control lists of IPs which may access the
  privileged web applications such as /escenic-admin, /escenic and
  /webservice.

  ece-install will also add the host from which you connect, making
  sure that if you've SSH-ed into the server to conduct the install,
  you'll automatically be included in the "staff" ACL and can access
  all the web applications without editing these ACLs (or disabling
  security as many does).

- will set up sticky sessions/session binding
- will set up a backend cluster and allow the user to enter the
  different backend servers that will serve the web site.
- will set up configuration to strip away cookies from static
  resources, such as CSS, JS and pictures.
- will install the nginx web server for serving static content and
  will configure Varnish accordingly. This will be very useful for
  Adactus servers wanting to pull content from your ECEs.
- will install a Munin gatherer and make its interface available 
  when accesssing the web server directly (port 81) 

TBD:
- If run on a Linux platform, the script will tweak the kernel
  parameters for optimal TCP handling for a web facing server.
- let the /munin run through on port 80, requiring the connecting IPs
  to be in the staff network ACL, defined in the Varnish
  configuration. 

** 8 - Install Widget Framework
You'll need a user name and password for accessing the
repo.escenic.com Maven repository. You should get these credentials
when you bought Widget Framework. If you for some reason do not have
these, please contact support@escenic.com. 

If you don't have these ready in your .ece-install.conf, ece-install will
complain:
#+BEGIN_SRC sh
[ece-install] Be sure to set wf_user and wf_password in /root/.ece-install.conf
[ece-install] If you don't have these, please contact support@escenic.com
#+END_SRC
** 9 - Create Publication
This profile will create a publication for you, only asking you the
name of the publication and which ECE instance to use for its
creation.

This installation profile will base the publication on the Widget
Framework if its present on the system, if not, ECE's clean demo WAR
is used as a basis.  
