usr/share/doc/escenic/ece-install-guide.html

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Available Server Profiles </h2>
<div class="outline-text-2" id="text-5">

<p>When starting the script, it will ask you which server profile you
want to install:
</p>


<pre class="example">Hi, which server profile do you wish to install?

Select 1-7 and press ENTER

  1 - The full stack on one host. Suitable for development and
      test environments (cache, ECE, assembly host &amp; database).
  2 - Editorial (publication) server (ECE, assembly host).
  3 - Presentation server (ECE, memcached).
  4 - Database server.
  5 - Cache server (cache &amp; web server).
  6 - RMI hub.
  7 - Standalone search instance (solr + indexer-webapp).
  8 - Install Widget Framework. This will also set up a WF based 
      publication for you (repo.escenic.com user/pass required).

</pre>




</div>

<div id="outline-container-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> Common for Editorial, Presentation and Search Instances </h3>
<div class="outline-text-3" id="text-5-1">


</div>

<div id="outline-container-5-1-1" class="outline-4">
<h4 id="sec-5-1-1"><span class="section-number-4">5.1.1</span> Sun Java 6 </h4>
<div class="outline-text-4" id="text-5-1-1">

</div>

</div>

<div id="outline-container-5-1-2" class="outline-4">
<h4 id="sec-5-1-2"><span class="section-number-4">5.1.2</span> Apache Tomcat application server </h4>
<div class="outline-text-4" id="text-5-1-2">

<ul>
<li>Compression of textual content (previously, this was typically set
  up with Apache and its mod_deflate module).
</li>
<li>pooling set up tweaked for high read/write performance.
</li>
<li>proper logging configuration directing solr messages to its own log.
</li>
<li>routing information in the cookies
</li>
<li>application server access log
</li>
</ul>

</div>

</div>

<div id="outline-container-5-1-3" class="outline-4">
<h4 id="sec-5-1-3"><span class="section-number-4">5.1.3</span> Basic Escenic Nursery configuration </h4>
<div class="outline-text-4" id="text-5-1-3">

<p>The basic Nursery configuration is taken care of for you, including RMI,
  database, search and application server/URIs. 
</p></div>

</div>

<div id="outline-container-5-1-4" class="outline-4">
<h4 id="sec-5-1-4"><span class="section-number-4">5.1.4</span> APR, native library for optimal Tomcat I/O performance </h4>
<div class="outline-text-4" id="text-5-1-4">

</div>

</div>

<div id="outline-container-5-1-5" class="outline-4">
<h4 id="sec-5-1-5"><span class="section-number-4">5.1.5</span> Escenic Assembly environment </h4>
<div class="outline-text-4" id="text-5-1-5">

<p>The reason why ece-install sets this up on each host, is to make the
installation process as smooth as possible. The assembly environment
may be removed after the installation if you want to.
</p>
</div>

</div>

<div id="outline-container-5-1-6" class="outline-4">
<h4 id="sec-5-1-6"><span class="section-number-4">5.1.6</span> Database driver </h4>
<div class="outline-text-4" id="text-5-1-6">


</div>

</div>

<div id="outline-container-5-1-7" class="outline-4">
<h4 id="sec-5-1-7"><span class="section-number-4">5.1.7</span> Compression of content </h4>
<div class="outline-text-4" id="text-5-1-7">

<p>This was was previously accomplished by having a web server in fron t
of the application server (or cache server if you used ESI). A typical
system architecture would contain Apache with mod_deflate. However,
this is no longer necessary as Varnish can handles ESI parsing of
compressed content (and many other things that we before needed Apache
for). Thus, we'll let the application server do the compression for us
now.
</p>
</div>
</div>

</div>

<div id="outline-container-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> 1 - Full Stack on One Host </h3>
<div class="outline-text-3" id="text-5-2">

<p>This profile is suitable for developers and admins wanting to set up a
test environment. It will install the full stack including caching
server, application server, ECE, assembly host, database, Widget
Framework, as well as creating a publication for you.
</p>
<p>
For further details on each of the different server components, see
the different profile descriptions bellow.
</p>

</div>

</div>

<div id="outline-container-5-3" class="outline-3">
<h3 id="sec-5-3"><span class="section-number-3">5.3</span> 2 - Editorial Server (Publication Server) </h3>
<div class="outline-text-3" id="text-5-3">



</div>

</div>

<div id="outline-container-5-4" class="outline-3">
<h3 id="sec-5-4"><span class="section-number-3">5.4</span> 3 - Presentation Server </h3>
<div class="outline-text-3" id="text-5-4">

<p>This will set up a typical presentation server:
</p><ul>
<li>Memcached, distributed memory cache
</li>
<li>Escenic Assembly environment (which may be removed after the
  installation). 
</li>
<li>Deployment setup to only deploy escenic-admin and the
  publication(s).
</li>
</ul>


</div>

</div>

<div id="outline-container-5-5" class="outline-3">
<h3 id="sec-5-5"><span class="section-number-3">5.5</span> 4 - Database Server </h3>
<div class="outline-text-3" id="text-5-5">

<p>If ece-install is run on a support version of Debian or Ubuntu, this
will install the excellent Percona distribution of MySQL with their
set of high performance patches.
</p>
<p>
If not, MySQL or Percona must be installed in advance.
</p>
<p>
Given that the mysqld is install, this profile will download all the
Escenic components and install the ECE database schema based from the
SQL files contained inside the distribution bundles. To accomplish
this, the script will make a call to drop-and-create-ecedb in the same
directory as the ece-intall script itself.
</p>
<p>
The script will fail by itself if the DB already exists:
</p>


<pre class="example">[ece-install] Setting up the ECE database schema ...
ERROR 1007 (HY000) at line 1: Can't create database 'ece5db'; database exists
ERROR 1050 (42S01) at line 2: Table 'DBChangeLog' already exists
[ece-install] running tables FAILED, exiting :-(

</pre>




</div>

</div>

<div id="outline-container-5-6" class="outline-3">
<h3 id="sec-5-6"><span class="section-number-3">5.6</span> 5 - Cache Server </h3>
<div class="outline-text-3" id="text-5-6">

<p>If ece-install is run on a support version of Debian or Ubuntu, it
will install the latest Varnish 3.0 caching server from the Varnish
APT repository.
</p>
<p>
If ece-install is run on a different platform, the admin must install
Varnish 3.x prior to running ece-install.
</p>
<p>
The script will configure Varnish for a typical Escenic site:
</p><ul>
<li>will set up an access control lists of IPs which may access the
  privileged web applications such as /escenic-admin, /escenic and
  /webservice.

<p>
  ece-install will also add the host from which you connect, making
  sure that if you've SSH-ed into the server to conduct the install,
  you'll automatically be included in the "staff" ACL and can access
  all the web applications without editing these ACLs (or disabling
  security as many does).
</p>
</li>
<li>will set up sticky sessions/session binding
</li>
<li>will set up a backend cluster and allow the user to enter the
  different backend servers that will serve the web site.
</li>
<li>will set up configuration to strip away cookies from static
  resources, such as CSS, JS and pictures.
</li>
</ul>


<p>
TBD:
</p><ul>
<li>If run on a Linux platform, the script will tweak the kernel
  parameters for optimal TCP handling for a web facing server.
</li>
<li>Will install the nginx web server for serving static content and
  will configure Varnish accordingly. This will be very useful for
  Adactus servers wanting to pull content from your ECEs.
</li>
</ul>


</div>

</div>

<div id="outline-container-5-7" class="outline-3">
<h3 id="sec-5-7"><span class="section-number-3">5.7</span> 8 - Install Widget Framework </h3>
<div class="outline-text-3" id="text-5-7">

<p>You'll need a user name and password for accessing the
repo.escenic.com Maven repository. You should get these credentials
when you bought Widget Framework. If you for some reason do not have
these, please contact support@escenic.com. 
</p>
<p>
If you don't have these ready in your .ece-install.conf, ece-install will
complain:
</p>


<pre class="example">[ece-install] Be sure to set wf_user and wf_password in /root/.ece-install.conf
[ece-install] If you don't have these, please contact support@escenic.com

</pre>



</div>

</div>

<div id="outline-container-5-8" class="outline-3">
<h3 id="sec-5-8"><span class="section-number-3">5.8</span> 9 - Create Publication </h3>
<div class="outline-text-3" id="text-5-8">

<p>This profile will create a publication for you, only asking you the
name of the publication and which ECE instance to use for its
creation.
</p>
<p>
This installation profile will base the publication on the Widget
Framework if its present on the system, if not, ECE's clean demo WAR
is used as a basis.  
</p></div>
</div>

</div>
