usr/share/doc/escenic/ece-install-guide.org
* Full Automatic Install (FAI)
The ece-install script has support for doing a full automatic install
(FAI).

The ece-install script understands for the following settings in the
$HOME/.ece-install.conf file of the root user:

|---------------------------------+------------------+-----------------------------------------------|
| Parameter                       |          Default | Description                                   |
|---------------------------------+------------------+-----------------------------------------------|
| fai\_all\_install               |                0 | Install all components on your server.        |
| fai\_cache\_install             |                0 | Install cache server profile                  |
| fai\_cache\_backends            | ${HOSTNAME}:8080 | Space separated, e.g. "app1:8080 app2:8080"   |
| fai\_db\_install                |                0 | Install db profile                            |
| fai\_db\_host                   |        $HOSTNAME | Useful for editor & presentation profiles     |
| fai\_db\_port                   |             3306 | Useful for editor & presentation profiles     |
| fai\_editor\_install            |                0 | Install the editorial profile                 |
| fai\_editor\_name               |          editor1 | Name of the editor instance                   |
| fai\_editor\_port               |             8080 | HTTP port of the editor instance              |
| fai\_editor\_shutdown           |             8005 | Shutdown port of the editor instance          |
| fai\_enabled                    |                0 | Whether or not to run ece-install in FAI mode |
| fai\_public\_host\_name         | ${HOSTNAME}:8080 | The public address for your website           |
| fai\_presentation\_install      |                0 | Install the presentation server profile       |
| fai\_presentation\_name         |             web1 | Name of the presentation server instance      |
| fai\_presentation\_port         |             8080 | HTTP port of the presentation server instance |
| fai\_presentation\_shutdown     |             8005 | Shutdown port of the presentation instance    |
| fai\_publication\_create        |                0 | Create a new publication                      |
| fai\_publication\_name          |            mypub | Name of the publication                       |
| fai\_publication\_use\_instance |             dev1 | Name of local instance to use for creation    |
| fai\_rmi\_install               |                0 | Install RMI hub profile                       |
| fai\_search\_name               |          search1 | Name of the search instance                   |
| fai\_search\_port               |             8080 | HTTP port of the search instance              |
| fai\_search\_shutdown           |             8005 | Shutdown port of the search instance          |
| fai\_wf\_install                |                0 | Install Widget Framework profile              |
|---------------------------------+------------------+-----------------------------------------------|

As you've probably have guessed, 0 means "false" and 1 means "true" :-)

To automatically install an editorial server and create a publication
called "jollygood", the minimal configuration in .ece-install.conf
would be:

#+BEGIN_SRC sh
fai_enabled=1
fai_editor_install=1
fai_publication_create=1
fai_publication_name=jollygood
#+END_SRC

When FAI is enabled, ece-install will report:
#+BEGIN_SRC sh
[ece-install] Full Automatic Install (FAI) enabled.
[ece-install] All user input will be read from /root/.ece-install.conf
#+END_SRC

* Running More Than One Installation Process
If the script believes there's already an ece-intall process running,
it will abort:
#+BEGIN_SRC sh
[ece-install] There's already one ece-install process running. If you believe
[ece-install] this is wrong, e.g. if a previous run of ece-install was aborted
[ece-install] before it completed, you may delete /var/run/ece-install.pid and
[ece-install] run ece-install again.
#+END_SRC

* Re-running ece-install (and How To Speed It Up)
Although the initial thought behind ece-install, is to run it on a
clean system to get up and running as soon as possible. However, you
may want to re-run ece-install on the same host, for instance to add
another instance of ECE, set up Widget Framework or create another
publication.

ece-install has a number of features which will try to minimise the
time it takes to run it on consecutive runs. If running on Debian
based systems, it will check if you already have installed
pre-requisite 3rd party libraries and only if any are missing will it
ask the package manager to fetch it.

Likewise, ece-install will see if the Escenic artifacts or application
server that you need are already present in the /tmp/ece-downloads
folder, and only download the missing ones (if any).

To get a list of the artifacts it'll pull from
http://technet.escenic.com and http://tomcat.apache.org search for the
following variables:
- technet\_download\_list
- wf\_download\_list
- tomcat\_download

