usr/share/doc/escenic/ece-install-guide.html

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Full Automatic Install (FAI) </h2>
<div class="outline-text-2" id="text-6">

<p>The ece-install script has support for doing a full automatic install
(FAI).
</p>
<p>
The ece-install script understands for the following settings in the
$HOME/.ece-install.conf file of the root user:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col class="left" /><col class="right" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Parameter</th><th scope="col" class="right">Default</th><th scope="col" class="left">Description</th></tr>
</thead>
<tbody>
<tr><td class="left">fai_all_install</td><td class="right">0</td><td class="left">Install all components on your server.</td></tr>
<tr><td class="left">fai_cache_install</td><td class="right">0</td><td class="left">Install cache server profile</td></tr>
<tr><td class="left">fai_cache_backends</td><td class="right">${HOSTNAME}:8080</td><td class="left">Space separated, e.g. "app1:8080 app2:8080"</td></tr>
<tr><td class="left">fai_db_install</td><td class="right">0</td><td class="left">Install db profile</td></tr>
<tr><td class="left">fai_db_host</td><td class="right">$HOSTNAME</td><td class="left">Useful for editor &amp; presentation profiles</td></tr>
<tr><td class="left">fai_db_port</td><td class="right">3306</td><td class="left">Useful for editor &amp; presentation profiles</td></tr>
<tr><td class="left">fai_editor_install</td><td class="right">0</td><td class="left">Install the editorial profile</td></tr>
<tr><td class="left">fai_editor_name</td><td class="right">editor1</td><td class="left">Name of the editor instance</td></tr>
<tr><td class="left">fai_editor_port</td><td class="right">8080</td><td class="left">HTTP port of the editor instance</td></tr>
<tr><td class="left">fai_editor_shutdown</td><td class="right">8005</td><td class="left">Shutdown port of the editor instance</td></tr>
<tr><td class="left">fai_enabled</td><td class="right">0</td><td class="left">Whether or not to run ece-install in FAI mode</td></tr>
<tr><td class="left">fai_public_host_name</td><td class="right">${HOSTNAME}:8080</td><td class="left">The public address for your website</td></tr>
<tr><td class="left">fai_presentation_install</td><td class="right">0</td><td class="left">Install the presentation server profile</td></tr>
<tr><td class="left">fai_presentation_name</td><td class="right">web1</td><td class="left">Name of the presentation server instance</td></tr>
<tr><td class="left">fai_presentation_port</td><td class="right">8080</td><td class="left">HTTP port of the presentation server instance</td></tr>
<tr><td class="left">fai_presentation_shutdown</td><td class="right">8005</td><td class="left">Shutdown port of the presentation instance</td></tr>
<tr><td class="left">fai_publication_create</td><td class="right">0</td><td class="left">Create a new publication</td></tr>
<tr><td class="left">fai_publication_name</td><td class="right">mypub</td><td class="left">Name of the publication</td></tr>
<tr><td class="left">fai_publication_use<sub>instance</sub></td><td class="right">dev1</td><td class="left">Name of local instance to use for creation</td></tr>
<tr><td class="left">fai_rmi_install</td><td class="right">0</td><td class="left">Install RMI hub profile</td></tr>
<tr><td class="left">fai_search_name</td><td class="right">search1</td><td class="left">Name of the search instance</td></tr>
<tr><td class="left">fai_search_port</td><td class="right">8080</td><td class="left">HTTP port of the search instance</td></tr>
<tr><td class="left">fai_search_shutdown</td><td class="right">8005</td><td class="left">Shutdown port of the search instance</td></tr>
<tr><td class="left">fai_wf_install</td><td class="right">0</td><td class="left">Install Widget Framework profile</td></tr>
</tbody>
</table>


<p>
As you've probably have guessed, 0 means "false" and 1 means "true" :-)
</p>
<p>
To automatically install an editorial server and create a publication
called "jollygood", the minimal configuration in .ece-install.conf
would be:
</p>



<pre class="example">fai_enabled=1
fai_editor_install=1
fai_publication_create=1
fai_publication_name=jollygood

</pre>




<p>
When FAI is enabled, ece-install will report:
</p>


<pre class="example">[ece-install] Full Automatic Install (FAI) enabled.
[ece-install] All user input will be read from /root/.ece-install.conf

</pre>




</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Running More Than One Installation Process </h2>
<div class="outline-text-2" id="text-7">

<p>If the script believes there's already an ece-intall process running,
it will abort:
</p>


<pre class="example">[ece-install] There's already one ece-install process running. If you believe
[ece-install] this is wrong, e.g. if a previous run of ece-install was aborted
[ece-install] before it completed, you may delete /var/run/ece-install.pid and
[ece-install] run ece-install again.

</pre>




</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Re-running ece-install (and How To Speed It Up) </h2>
<div class="outline-text-2" id="text-8">

<p>Although the initial thought behind ece-install, is to run it on a
clean system to get up and running as soon as possible. However, you
may want to re-run ece-install on the same host, for instance to add
another instance of ECE, set up Widget Framework or create another
publication.
</p>
<p>
ece-install has a number of features which will try to minimise the
time it takes to run it on consecutive runs. If running on Debian
based systems, it will check if you already have installed
pre-requisite 3rd party libraries and only if any are missing will it
ask the package manager to fetch it.
</p>
<p>
Likewise, ece-install will see if the Escenic artifacts or application
server that you need are already present in the /tmp/ece-downloads
folder, and only download the missing ones (if any).
</p>
<p>
To get a list of the artifacts it'll pull from
<a href="http://technet.escenic.com">http://technet.escenic.com</a> and http://tomcat.apache.org search for the
following variables:
</p><ul>
<li>technet_download_list
</li>
<li>wf_download_list
</li>
<li>tomcat_download
</li>
</ul>


</div>

</div>
