usr/share/doc/escenic/ece-install-guide.org
* Overview of File Paths Used by the ece-install script
There are of course other paths involved when setting up your system,
but these should be the most interesting ones.

|---------------------------------------------+------------------------------------------------------------------|
| Path                                        | Explanation                                                      |
|---------------------------------------------+------------------------------------------------------------------|
| /etc/apt/sources.list.d/escenic.list        | 3rd party APT repositories added by ece-install *)               |
| /etc/default/ece                            | The configuration file for the ece init.d script                 |
| /etc/escenic/ece-<instance>.conf            | Instance specific settings for /usr/bin/ece                      |
| /etc/escenic/ece.conf                       | Common ece.conf file for /usr/bin/ece                            |
| /etc/escenic/engine/common                  | Common Nursery configuration layer                               |
| /etc/escenic/engine/common/security         | Common security configuration for all ECE instances.             |
| /etc/escenic/engine/common/trace.properties | Log4j configuration, produces instance specific log files.       |
| /etc/escenic/engine/instance/<instance>     | Instance specific Nursery configuration                          |
| /etc/escenic/solr                           | ECE specific Solr configuration                                  |
| /etc/init.d/mysql[d]                        | For starting and stopping MySQL/Percona                          |
| /etc/init.d/varnish                         | For starting and stopping Varnish                                |
| /etc/intit.d/ece                            | The init.d script managing _all_ the ECE instances on your host. |
| /etc/varnish/default.vcl                    | The Varnish configuration                                        |
| /opt/escenic                                | All ECE components can be found here                             |
| /opt/escenic/assemblytool                   | The assembly tool                                                |
| /opt/escenic/assemblytool/plugins           | Contains symlinks to all plugins in /opt/escenic                 |
| /opt/escenic/engine                         | Symlink pointing to the current ECE                              |
| /opt/tomcat                                 | Symlink pointing to the install Apache Tomcat (catalina\_home)   |
| /opt/tomcat-<instance>                      | Instance specific Tomcat files (catalina\_base)                  |
| /usr/bin/ece                                | Script for operating all ECE instances + RMI hub and EAE         |
| /usr/sbin/drop-and-create-ecedb             | DB script used by the ece-install script                         |
| /usr/sbin/ece-install                       | The installation script described in this guide                  |
| /var/log/escenic/<type>-<instance>.log      | The instance's log4j  log                                        |
| /var/log/escenic/<type>-<instance>.out      | The instance system out log                                      |
| /var/log/escenic/solr.<date>.log            | The Solr log (not in standard out!)                              |
| /var/run/escenic/<type>-<instance>.pid      | The instance's  PID file                                         |
|---------------------------------------------+------------------------------------------------------------------|

*) Applies only to Debian based systems.

* Assumptions
** /etc/esecenic is shared
It's assumed that the /etc/escenic directory is either on a shared
file system or rsync-ed among the hosts that are running the ECE
instances (the exception being database and cache servers).
 
* Uninstalling Everything That the ece-install Set Up
WARNING: this is potentially dangerous as some of these components may
be used by other pieces of software you have running on your
host. However, this may be useful if you're installing a clean
environment and want to e.g. undo your previous install to install a
different profile.

Open the ece-install script and look for the "un\_install\_ece"
function, it has copy and pastable commands for undoing most/all
things set up by the script.


* Example Output FAI
The ece-install will often be run in FAI mode where all the settings
are read from ~/.ece-install.conf. Given the following entries in this
file: 
#+BEGIN_SRC sh
technet_user=apples
technet_password=andoranges
wf_user=foo
wf_password=bar

fai_enabled=1
fai_all_install=1
#+END_SRC

The following output is produced from ece-install:
#+INCLUDE: "/tmp/ece-install.out" src text

