usr/share/doc/escenic/ece-install-guide.html

<div id="outline-container-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> Overview of File Paths Used by the ece-install script </h2>
<div class="outline-text-2" id="text-9">

<p>There are of course other paths involved when setting up your system,
but these should be the most interesting ones.
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Path</th><th scope="col" class="left">Explanation</th></tr>
</thead>
<tbody>
<tr><td class="left">/etc/apt/sources.list.d/escenic.list</td><td class="left">3rd party APT repositories added by ece-install *)</td></tr>
<tr><td class="left">/etc/default/ece</td><td class="left">The configuration file for the ece init.d script</td></tr>
<tr><td class="left">/etc/escenic/ece-&lt;instance&gt;.conf</td><td class="left">Instance specific settings for /usr/bin/ece</td></tr>
<tr><td class="left">/etc/escenic/ece.conf</td><td class="left">Common ece.conf file for /usr/bin/ece</td></tr>
<tr><td class="left">/etc/escenic/engine/common</td><td class="left">Common Nursery configuration layer</td></tr>
<tr><td class="left">/etc/escenic/engine/common/security</td><td class="left">Common security configuration for all ECE instances.</td></tr>
<tr><td class="left">/etc/escenic/engine/common/trace.properties</td><td class="left">Log4j configuration, produces instance specific log files.</td></tr>
<tr><td class="left">/etc/escenic/engine/instance/&lt;instance&gt;</td><td class="left">Instance specific Nursery configuration</td></tr>
<tr><td class="left">/etc/escenic/solr</td><td class="left">ECE specific Solr configuration</td></tr>
<tr><td class="left">/etc/init.d/mysql[d]</td><td class="left">For starting and stopping MySQL/Percona</td></tr>
<tr><td class="left">/etc/init.d/varnish</td><td class="left">For starting and stopping Varnish</td></tr>
<tr><td class="left">/etc/intit.d/ece</td><td class="left">The init.d script managing <span style="text-decoration:underline;">all</span> the ECE instances on your host.</td></tr>
<tr><td class="left">/etc/varnish/default.vcl</td><td class="left">The Varnish configuration</td></tr>
<tr><td class="left">/opt/escenic</td><td class="left">All ECE components can be found here</td></tr>
<tr><td class="left">/opt/escenic/assemblytool</td><td class="left">The assembly tool</td></tr>
<tr><td class="left">/opt/escenic/assemblytool/plugins</td><td class="left">Contains symlinks to all plugins in /opt/escenic</td></tr>
<tr><td class="left">/opt/escenic/engine</td><td class="left">Symlink pointing to the current ECE</td></tr>
<tr><td class="left">/opt/tomcat</td><td class="left">Symlink pointing to the install Apache Tomcat (catalina_home)</td></tr>
<tr><td class="left">/opt/tomcat-&lt;instance&gt;</td><td class="left">Instance specific Tomcat files (catalina_base)</td></tr>
<tr><td class="left">/usr/bin/ece</td><td class="left">Script for operating all ECE instances + RMI hub and EAE</td></tr>
<tr><td class="left">/usr/sbin/drop-and-create-ecedb</td><td class="left">DB script used by the ece-install script</td></tr>
<tr><td class="left">/usr/sbin/ece-install</td><td class="left">The installation script described in this guide</td></tr>
<tr><td class="left">/var/log/escenic/&lt;type&gt;-&lt;instance&gt;.log</td><td class="left">The instance's log4j  log</td></tr>
<tr><td class="left">/var/log/escenic/&lt;type&gt;-&lt;instance&gt;.out</td><td class="left">The instance system out log</td></tr>
<tr><td class="left">/var/log/escenic/solr.&lt;date&gt;.log</td><td class="left">The Solr log (not in standard out!)</td></tr>
<tr><td class="left">/var/run/escenic/&lt;type&gt;-&lt;instance&gt;.pid</td><td class="left">The instance's  PID file</td></tr>
</tbody>
</table>


<p>
*) Applies only to Debian based systems.
</p>
</div>

</div>

<div id="outline-container-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> Assumptions </h2>
<div class="outline-text-2" id="text-10">


</div>

<div id="outline-container-10-1" class="outline-3">
<h3 id="sec-10-1"><span class="section-number-3">10.1</span> /etc/esecenic is shared </h3>
<div class="outline-text-3" id="text-10-1">

<p>It's assumed that the /etc/escenic directory is either on a shared
file system or rsync-ed among the hosts that are running the ECE
instances (the exception being database and cache servers).
</p>
</div>
</div>

</div>

<div id="outline-container-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> Uninstalling Everything That the ece-install Set Up </h2>
<div class="outline-text-2" id="text-11">

<p>WARNING: this is potentially dangerous as some of these components may
be used by other pieces of software you have running on your
host. However, this may be useful if you're installing a clean
environment and want to e.g. undo your previous install to install a
different profile.
</p>
<p>
Open the ece-install script and look for the "un_install_ece"
function, it has copy and pastable commands for undoing most/all
things set up by the script.
</p>

</div>

</div>

<div id="outline-container-12" class="outline-2">
<h2 id="sec-12"><span class="section-number-2">12</span> Example Output FAI </h2>
<div class="outline-text-2" id="text-12">

<p>The ece-install will often be run in FAI mode where all the settings
are read from ~/.ece-install.conf. Given the following entries in this
file: 
</p>


<pre class="example">technet_user=apples
technet_password=andoranges
wf_user=foo
wf_password=bar

fai_enabled=1
fai_all_install=1

</pre>




<p>
The following output is produced from ece-install:
</p>


<pre class="example">hei

</pre>




</div>
</div>
<div id="postamble">
<hr/>
<p class="author">
  Author: Torstein Krause Johansen (<a href="mailto:tkj@vizrt.com">tkj@vizrt.com</a>)
  Date: 2011-09-12 17:32:07 CST
</p></div>
</div>
</body>
</html>
